grevaillot/svd_tools/headers/STM32H7x5_CM7/fdcan1.h
#pragma once 

/* --- FDCAN1: FDCAN1 ----------------------------------------------- */

/** @defgroup fdcan1_registers FDCAN1 Register
@{*/

/** FDCAN1_FDCAN_CREL FDCAN Core Release Register **/
#define FDCAN1_FDCAN_CREL			MMIO32(FDCAN1_BASE + 0x00)
/** FDCAN1_FDCAN_ENDN FDCAN Core Release Register **/
#define FDCAN1_FDCAN_ENDN			MMIO32(FDCAN1_BASE + 0x04)
/** FDCAN1_FDCAN_DBTP FDCAN Data Bit Timing and Prescaler Register **/
#define FDCAN1_FDCAN_DBTP			MMIO32(FDCAN1_BASE + 0x0c)
/** FDCAN1_FDCAN_TEST FDCAN Test Register **/
#define FDCAN1_FDCAN_TEST			MMIO32(FDCAN1_BASE + 0x10)
/** FDCAN1_FDCAN_RWD FDCAN RAM Watchdog Register **/
#define FDCAN1_FDCAN_RWD			MMIO32(FDCAN1_BASE + 0x14)
/** FDCAN1_FDCAN_CCCR FDCAN CC Control Register **/
#define FDCAN1_FDCAN_CCCR			MMIO32(FDCAN1_BASE + 0x18)
/** FDCAN1_FDCAN_NBTP FDCAN Nominal Bit Timing and Prescaler Register **/
#define FDCAN1_FDCAN_NBTP			MMIO32(FDCAN1_BASE + 0x1c)
/** FDCAN1_FDCAN_TSCC FDCAN Timestamp Counter Configuration Register **/
#define FDCAN1_FDCAN_TSCC			MMIO32(FDCAN1_BASE + 0x20)
/** FDCAN1_FDCAN_TSCV FDCAN Timestamp Counter Value Register **/
#define FDCAN1_FDCAN_TSCV			MMIO32(FDCAN1_BASE + 0x24)
/** FDCAN1_FDCAN_TOCC FDCAN Timeout Counter Configuration Register **/
#define FDCAN1_FDCAN_TOCC			MMIO32(FDCAN1_BASE + 0x28)
/** FDCAN1_FDCAN_TOCV FDCAN Timeout Counter Value Register **/
#define FDCAN1_FDCAN_TOCV			MMIO32(FDCAN1_BASE + 0x2c)
/** FDCAN1_FDCAN_ECR FDCAN Error Counter Register **/
#define FDCAN1_FDCAN_ECR			MMIO32(FDCAN1_BASE + 0x40)
/** FDCAN1_FDCAN_PSR FDCAN Protocol Status Register **/
#define FDCAN1_FDCAN_PSR			MMIO32(FDCAN1_BASE + 0x44)
/** FDCAN1_FDCAN_TDCR FDCAN Transmitter Delay Compensation Register **/
#define FDCAN1_FDCAN_TDCR			MMIO32(FDCAN1_BASE + 0x48)
/** FDCAN1_FDCAN_IR FDCAN Interrupt Register **/
#define FDCAN1_FDCAN_IR			MMIO32(FDCAN1_BASE + 0x50)
/** FDCAN1_FDCAN_IE FDCAN Interrupt Enable Register **/
#define FDCAN1_FDCAN_IE			MMIO32(FDCAN1_BASE + 0x54)
/** FDCAN1_FDCAN_ILS FDCAN Interrupt Line Select Register **/
#define FDCAN1_FDCAN_ILS			MMIO32(FDCAN1_BASE + 0x58)
/** FDCAN1_FDCAN_ILE FDCAN Interrupt Line Enable Register **/
#define FDCAN1_FDCAN_ILE			MMIO32(FDCAN1_BASE + 0x5c)
/** FDCAN1_FDCAN_GFC FDCAN Global Filter Configuration Register **/
#define FDCAN1_FDCAN_GFC			MMIO32(FDCAN1_BASE + 0x80)
/** FDCAN1_FDCAN_SIDFC FDCAN Standard ID Filter Configuration Register **/
#define FDCAN1_FDCAN_SIDFC			MMIO32(FDCAN1_BASE + 0x84)
/** FDCAN1_FDCAN_XIDFC FDCAN Extended ID Filter Configuration Register **/
#define FDCAN1_FDCAN_XIDFC			MMIO32(FDCAN1_BASE + 0x88)
/** FDCAN1_FDCAN_XIDAM FDCAN Extended ID and Mask Register **/
#define FDCAN1_FDCAN_XIDAM			MMIO32(FDCAN1_BASE + 0x90)
/** FDCAN1_FDCAN_HPMS FDCAN High Priority Message Status Register **/
#define FDCAN1_FDCAN_HPMS			MMIO32(FDCAN1_BASE + 0x94)
/** FDCAN1_FDCAN_NDAT1 FDCAN New Data 1 Register **/
#define FDCAN1_FDCAN_NDAT1			MMIO32(FDCAN1_BASE + 0x98)
/** FDCAN1_FDCAN_NDAT2 FDCAN New Data 2 Register **/
#define FDCAN1_FDCAN_NDAT2			MMIO32(FDCAN1_BASE + 0x9c)
/** FDCAN1_FDCAN_RXF0C FDCAN Rx FIFO 0 Configuration Register **/
#define FDCAN1_FDCAN_RXF0C			MMIO32(FDCAN1_BASE + 0xa0)
/** FDCAN1_FDCAN_RXF0S FDCAN Rx FIFO 0 Status Register **/
#define FDCAN1_FDCAN_RXF0S			MMIO32(FDCAN1_BASE + 0xa4)
/** FDCAN1_FDCAN_RXF0A CAN Rx FIFO 0 Acknowledge Register **/
#define FDCAN1_FDCAN_RXF0A			MMIO32(FDCAN1_BASE + 0xa8)
/** FDCAN1_FDCAN_RXBC FDCAN Rx Buffer Configuration Register **/
#define FDCAN1_FDCAN_RXBC			MMIO32(FDCAN1_BASE + 0xac)
/** FDCAN1_FDCAN_RXF1C FDCAN Rx FIFO 1 Configuration Register **/
#define FDCAN1_FDCAN_RXF1C			MMIO32(FDCAN1_BASE + 0xb0)
/** FDCAN1_FDCAN_RXF1S FDCAN Rx FIFO 1 Status Register **/
#define FDCAN1_FDCAN_RXF1S			MMIO32(FDCAN1_BASE + 0xb4)
/** FDCAN1_FDCAN_RXF1A FDCAN Rx FIFO 1 Acknowledge Register **/
#define FDCAN1_FDCAN_RXF1A			MMIO32(FDCAN1_BASE + 0xb8)
/** FDCAN1_FDCAN_RXESC FDCAN Rx Buffer Element Size Configuration Register **/
#define FDCAN1_FDCAN_RXESC			MMIO32(FDCAN1_BASE + 0xbc)
/** FDCAN1_FDCAN_TXBC FDCAN Tx Buffer Configuration Register **/
#define FDCAN1_FDCAN_TXBC			MMIO32(FDCAN1_BASE + 0xc0)
/** FDCAN1_FDCAN_TXFQS FDCAN Tx FIFO/Queue Status Register **/
#define FDCAN1_FDCAN_TXFQS			MMIO32(FDCAN1_BASE + 0xc4)
/** FDCAN1_FDCAN_TXESC FDCAN Tx Buffer Element Size Configuration Register **/
#define FDCAN1_FDCAN_TXESC			MMIO32(FDCAN1_BASE + 0xc8)
/** FDCAN1_FDCAN_TXBRP FDCAN Tx Buffer Request Pending Register **/
#define FDCAN1_FDCAN_TXBRP			MMIO32(FDCAN1_BASE + 0xcc)
/** FDCAN1_FDCAN_TXBAR FDCAN Tx Buffer Add Request Register **/
#define FDCAN1_FDCAN_TXBAR			MMIO32(FDCAN1_BASE + 0xd0)
/** FDCAN1_FDCAN_TXBCR FDCAN Tx Buffer Cancellation Request Register **/
#define FDCAN1_FDCAN_TXBCR			MMIO32(FDCAN1_BASE + 0xd4)
/** FDCAN1_FDCAN_TXBTO FDCAN Tx Buffer Transmission Occurred Register **/
#define FDCAN1_FDCAN_TXBTO			MMIO32(FDCAN1_BASE + 0xd8)
/** FDCAN1_FDCAN_TXBCF FDCAN Tx Buffer Cancellation Finished Register **/
#define FDCAN1_FDCAN_TXBCF			MMIO32(FDCAN1_BASE + 0xdc)
/** FDCAN1_FDCAN_TXBTIE FDCAN Tx Buffer Transmission Interrupt Enable Register **/
#define FDCAN1_FDCAN_TXBTIE			MMIO32(FDCAN1_BASE + 0xe0)
/** FDCAN1_FDCAN_TXBCIE FDCAN Tx Buffer Cancellation Finished Interrupt Enable Register **/
#define FDCAN1_FDCAN_TXBCIE			MMIO32(FDCAN1_BASE + 0xe4)
/** FDCAN1_FDCAN_TXEFC FDCAN Tx Event FIFO Configuration Register **/
#define FDCAN1_FDCAN_TXEFC			MMIO32(FDCAN1_BASE + 0xf0)
/** FDCAN1_FDCAN_TXEFS FDCAN Tx Event FIFO Status Register **/
#define FDCAN1_FDCAN_TXEFS			MMIO32(FDCAN1_BASE + 0xf4)
/** FDCAN1_FDCAN_TXEFA FDCAN Tx Event FIFO Acknowledge Register **/
#define FDCAN1_FDCAN_TXEFA			MMIO32(FDCAN1_BASE + 0xf8)
/** FDCAN1_FDCAN_TTTMC FDCAN TT Trigger Memory Configuration Register **/
#define FDCAN1_FDCAN_TTTMC			MMIO32(FDCAN1_BASE + 0x100)
/** FDCAN1_FDCAN_TTRMC FDCAN TT Reference Message Configuration Register **/
#define FDCAN1_FDCAN_TTRMC			MMIO32(FDCAN1_BASE + 0x104)
/** FDCAN1_FDCAN_TTOCF FDCAN TT Operation Configuration Register **/
#define FDCAN1_FDCAN_TTOCF			MMIO32(FDCAN1_BASE + 0x108)
/** FDCAN1_FDCAN_TTMLM FDCAN TT Matrix Limits Register **/
#define FDCAN1_FDCAN_TTMLM			MMIO32(FDCAN1_BASE + 0x10c)
/** FDCAN1_FDCAN_TURCF FDCAN TUR Configuration Register **/
#define FDCAN1_FDCAN_TURCF			MMIO32(FDCAN1_BASE + 0x110)
/** FDCAN1_FDCAN_TTOCN FDCAN TT Operation Control Register **/
#define FDCAN1_FDCAN_TTOCN			MMIO32(FDCAN1_BASE + 0x114)
/** FDCAN1_CAN_TTGTP FDCAN TT Global Time Preset Register **/
#define FDCAN1_CAN_TTGTP			MMIO32(FDCAN1_BASE + 0x118)
/** FDCAN1_FDCAN_TTTMK FDCAN TT Time Mark Register **/
#define FDCAN1_FDCAN_TTTMK			MMIO32(FDCAN1_BASE + 0x11c)
/** FDCAN1_FDCAN_TTIR FDCAN TT Interrupt Register **/
#define FDCAN1_FDCAN_TTIR			MMIO32(FDCAN1_BASE + 0x120)
/** FDCAN1_FDCAN_TTIE FDCAN TT Interrupt Enable Register **/
#define FDCAN1_FDCAN_TTIE			MMIO32(FDCAN1_BASE + 0x124)
/** FDCAN1_FDCAN_TTILS FDCAN TT Interrupt Line Select Register **/
#define FDCAN1_FDCAN_TTILS			MMIO32(FDCAN1_BASE + 0x128)
/** FDCAN1_FDCAN_TTOST FDCAN TT Operation Status Register **/
#define FDCAN1_FDCAN_TTOST			MMIO32(FDCAN1_BASE + 0x12c)
/** FDCAN1_FDCAN_TURNA FDCAN TUR Numerator Actual Register **/
#define FDCAN1_FDCAN_TURNA			MMIO32(FDCAN1_BASE + 0x130)
/** FDCAN1_FDCAN_TTLGT FDCAN TT Local and Global Time Register **/
#define FDCAN1_FDCAN_TTLGT			MMIO32(FDCAN1_BASE + 0x134)
/** FDCAN1_FDCAN_TTCTC FDCAN TT Cycle Time and Count Register **/
#define FDCAN1_FDCAN_TTCTC			MMIO32(FDCAN1_BASE + 0x138)
/** FDCAN1_FDCAN_TTCPT FDCAN TT Capture Time Register **/
#define FDCAN1_FDCAN_TTCPT			MMIO32(FDCAN1_BASE + 0x13c)
/** FDCAN1_FDCAN_TTCSM FDCAN TT Cycle Sync Mark Register **/
#define FDCAN1_FDCAN_TTCSM			MMIO32(FDCAN1_BASE + 0x140)
/** FDCAN1_FDCAN_TTTS FDCAN TT Trigger Select Register **/
#define FDCAN1_FDCAN_TTTS			MMIO32(FDCAN1_BASE + 0x300)

/**@}*/


/** @defgroup fdcan1_fdcan_crel FDCANCREL FDCAN Core Release Register
@{*/


#define FDCAN1_FDCAN_CREL_REL_SHIFT		28
#define FDCAN1_FDCAN_CREL_REL_MASK		0x0f
/** @defgroup fdcan1_fdcan_crel_rel REL Core release
@{*/
/**@}*/


