grevaillot/svd_tools/headers/STM32H7x5_CM7/fdcan1.h
#define FDCAN1_FDCAN_TOCV_TOC_SHIFT		0
#define FDCAN1_FDCAN_TOCV_TOC_MASK		0xffff
/** @defgroup fdcan1_fdcan_tocv_toc TOC Timeout Counter
@{*/
/**@}*/


/**@}*/

/** @defgroup fdcan1_fdcan_ecr FDCANECR FDCAN Error Counter Register
@{*/


#define FDCAN1_FDCAN_ECR_CEL_SHIFT		16
#define FDCAN1_FDCAN_ECR_CEL_MASK		0xff
/** @defgroup fdcan1_fdcan_ecr_cel CEL AN Error Logging
@{*/
/**@}*/

/** FDCAN1_FDCAN_ECR_RP Receive Error Passive **/
#define FDCAN1_FDCAN_ECR_RP		(1 << 15)

#define FDCAN1_FDCAN_ECR_TREC_SHIFT		8
#define FDCAN1_FDCAN_ECR_TREC_MASK		0x7f
/** @defgroup fdcan1_fdcan_ecr_trec TREC Receive Error Counter
@{*/
/**@}*/


#define FDCAN1_FDCAN_ECR_TEC_SHIFT		0
#define FDCAN1_FDCAN_ECR_TEC_MASK		0xff
/** @defgroup fdcan1_fdcan_ecr_tec TEC Transmit Error Counter
@{*/
/**@}*/


/**@}*/

/** @defgroup fdcan1_fdcan_psr FDCANPSR FDCAN Protocol Status Register
@{*/


#define FDCAN1_FDCAN_PSR_TDCV_SHIFT		16
#define FDCAN1_FDCAN_PSR_TDCV_MASK		0x7f
/** @defgroup fdcan1_fdcan_psr_tdcv TDCV Transmitter Delay Compensation Value
@{*/
/**@}*/

/** FDCAN1_FDCAN_PSR_PXE Protocol Exception Event **/
#define FDCAN1_FDCAN_PSR_PXE		(1 << 14)
/** FDCAN1_FDCAN_PSR_REDL Received FDCAN Message **/
#define FDCAN1_FDCAN_PSR_REDL		(1 << 13)
/** FDCAN1_FDCAN_PSR_RBRS BRS flag of last received FDCAN Message **/
#define FDCAN1_FDCAN_PSR_RBRS		(1 << 12)
/** FDCAN1_FDCAN_PSR_RESI ESI flag of last received FDCAN Message **/
#define FDCAN1_FDCAN_PSR_RESI		(1 << 11)

#define FDCAN1_FDCAN_PSR_DLEC_SHIFT		8
#define FDCAN1_FDCAN_PSR_DLEC_MASK		0x07
/** @defgroup fdcan1_fdcan_psr_dlec DLEC Data Last Error Code
@{*/
/**@}*/

/** FDCAN1_FDCAN_PSR_BO Bus_Off Status **/
#define FDCAN1_FDCAN_PSR_BO		(1 << 7)
/** FDCAN1_FDCAN_PSR_EW Warning Status **/
#define FDCAN1_FDCAN_PSR_EW		(1 << 6)
/** FDCAN1_FDCAN_PSR_EP Error Passive **/
#define FDCAN1_FDCAN_PSR_EP		(1 << 5)

#define FDCAN1_FDCAN_PSR_ACT_SHIFT		3
#define FDCAN1_FDCAN_PSR_ACT_MASK		0x03
/** @defgroup fdcan1_fdcan_psr_act ACT Activity
@{*/
/**@}*/


#define FDCAN1_FDCAN_PSR_LEC_SHIFT		0
#define FDCAN1_FDCAN_PSR_LEC_MASK		0x07
/** @defgroup fdcan1_fdcan_psr_lec LEC Last Error Code
@{*/
/**@}*/


/**@}*/

/** @defgroup fdcan1_fdcan_tdcr FDCANTDCR FDCAN Transmitter Delay Compensation Register
@{*/


#define FDCAN1_FDCAN_TDCR_TDCO_SHIFT		8
#define FDCAN1_FDCAN_TDCR_TDCO_MASK		0x7f
/** @defgroup fdcan1_fdcan_tdcr_tdco TDCO Transmitter Delay Compensation Offset
@{*/
/**@}*/


#define FDCAN1_FDCAN_TDCR_TDCF_SHIFT		0
#define FDCAN1_FDCAN_TDCR_TDCF_MASK		0x7f
/** @defgroup fdcan1_fdcan_tdcr_tdcf TDCF Transmitter Delay Compensation Filter Window Length
@{*/
/**@}*/


/**@}*/

/** @defgroup fdcan1_fdcan_ir FDCANIR FDCAN Interrupt Register
@{*/

/** FDCAN1_FDCAN_IR_ARA Access to Reserved Address **/
#define FDCAN1_FDCAN_IR_ARA		(1 << 29)
/** FDCAN1_FDCAN_IR_PED Protocol Error in Data Phase (Data Bit Time is used) **/
#define FDCAN1_FDCAN_IR_PED		(1 << 28)
/** FDCAN1_FDCAN_IR_PEA Protocol Error in Arbitration Phase (Nominal Bit Time is used) **/
#define FDCAN1_FDCAN_IR_PEA		(1 << 27)
/** FDCAN1_FDCAN_IR_WDI Watchdog Interrupt **/
#define FDCAN1_FDCAN_IR_WDI		(1 << 26)
/** FDCAN1_FDCAN_IR_BO Bus_Off Status **/
#define FDCAN1_FDCAN_IR_BO		(1 << 25)
/** FDCAN1_FDCAN_IR_EW Warning Status **/
#define FDCAN1_FDCAN_IR_EW		(1 << 24)
/** FDCAN1_FDCAN_IR_EP Error Passive **/
#define FDCAN1_FDCAN_IR_EP		(1 << 23)
/** FDCAN1_FDCAN_IR_ELO Error Logging Overflow **/
#define FDCAN1_FDCAN_IR_ELO		(1 << 22)
/** FDCAN1_FDCAN_IR_DRX Message stored to Dedicated Rx Buffer **/
#define FDCAN1_FDCAN_IR_DRX		(1 << 19)
/** FDCAN1_FDCAN_IR_TOO Timeout Occurred **/
#define FDCAN1_FDCAN_IR_TOO		(1 << 18)
/** FDCAN1_FDCAN_IR_MRAF Message RAM Access Failure **/
#define FDCAN1_FDCAN_IR_MRAF		(1 << 17)
/** FDCAN1_FDCAN_IR_TSW Timestamp Wraparound **/
#define FDCAN1_FDCAN_IR_TSW		(1 << 16)
/** FDCAN1_FDCAN_IR_TEFL Tx Event FIFO Element Lost **/
#define FDCAN1_FDCAN_IR_TEFL		(1 << 15)
/** FDCAN1_FDCAN_IR_TEFF Tx Event FIFO Full **/
#define FDCAN1_FDCAN_IR_TEFF		(1 << 14)
/** FDCAN1_FDCAN_IR_TEFW Tx Event FIFO Watermark Reached **/
#define FDCAN1_FDCAN_IR_TEFW		(1 << 13)
/** FDCAN1_FDCAN_IR_TEFN Tx Event FIFO New Entry **/
#define FDCAN1_FDCAN_IR_TEFN		(1 << 12)
/** FDCAN1_FDCAN_IR_TEF Tx FIFO Empty **/
#define FDCAN1_FDCAN_IR_TEF		(1 << 11)
/** FDCAN1_FDCAN_IR_TCF Transmission Cancellation Finished **/
#define FDCAN1_FDCAN_IR_TCF		(1 << 10)
/** FDCAN1_FDCAN_IR_TC Transmission Completed **/
#define FDCAN1_FDCAN_IR_TC		(1 << 9)
/** FDCAN1_FDCAN_IR_HPM High Priority Message **/
#define FDCAN1_FDCAN_IR_HPM		(1 << 8)
/** FDCAN1_FDCAN_IR_RF1L Rx FIFO 1 Message Lost **/
#define FDCAN1_FDCAN_IR_RF1L		(1 << 7)
/** FDCAN1_FDCAN_IR_RF1F Rx FIFO 1 Watermark Reached **/
#define FDCAN1_FDCAN_IR_RF1F		(1 << 6)
/** FDCAN1_FDCAN_IR_RF1W Rx FIFO 1 Watermark Reached **/
#define FDCAN1_FDCAN_IR_RF1W		(1 << 5)
/** FDCAN1_FDCAN_IR_RF1N Rx FIFO 1 New Message **/
#define FDCAN1_FDCAN_IR_RF1N		(1 << 4)
/** FDCAN1_FDCAN_IR_RF0L Rx FIFO 0 Message Lost **/
#define FDCAN1_FDCAN_IR_RF0L		(1 << 3)
/** FDCAN1_FDCAN_IR_RF0F Rx FIFO 0 Full **/
#define FDCAN1_FDCAN_IR_RF0F		(1 << 2)
/** FDCAN1_FDCAN_IR_RF0W Rx FIFO 0 Full **/
#define FDCAN1_FDCAN_IR_RF0W		(1 << 1)
/** FDCAN1_FDCAN_IR_RF0N Rx FIFO 0 New Message **/
#define FDCAN1_FDCAN_IR_RF0N		(1 << 0)

/**@}*/

/** @defgroup fdcan1_fdcan_ie FDCANIE FDCAN Interrupt Enable Register
@{*/

/** FDCAN1_FDCAN_IE_ARAE Access to Reserved Address Enable **/
#define FDCAN1_FDCAN_IE_ARAE		(1 << 29)
/** FDCAN1_FDCAN_IE_PEDE Protocol Error in Data Phase Enable **/
#define FDCAN1_FDCAN_IE_PEDE		(1 << 28)
/** FDCAN1_FDCAN_IE_PEAE Protocol Error in Arbitration Phase Enable **/
#define FDCAN1_FDCAN_IE_PEAE		(1 << 27)
/** FDCAN1_FDCAN_IE_WDIE Watchdog Interrupt Enable **/
#define FDCAN1_FDCAN_IE_WDIE		(1 << 26)
/** FDCAN1_FDCAN_IE_BOE Bus_Off Status Enable **/
#define FDCAN1_FDCAN_IE_BOE		(1 << 25)
/** FDCAN1_FDCAN_IE_EWE Warning Status Enable **/
#define FDCAN1_FDCAN_IE_EWE		(1 << 24)
/** FDCAN1_FDCAN_IE_EPE Error Passive Enable **/
#define FDCAN1_FDCAN_IE_EPE		(1 << 23)
/** FDCAN1_FDCAN_IE_ELOE Error Logging Overflow Enable **/
#define FDCAN1_FDCAN_IE_ELOE		(1 << 22)
/** FDCAN1_FDCAN_IE_BEUE Bit Error Uncorrected Interrupt Enable **/
#define FDCAN1_FDCAN_IE_BEUE		(1 << 21)
/** FDCAN1_FDCAN_IE_BECE Bit Error Corrected Interrupt Enable **/
#define FDCAN1_FDCAN_IE_BECE		(1 << 20)
/** FDCAN1_FDCAN_IE_DRXE Message stored to Dedicated Rx Buffer Enable **/
#define FDCAN1_FDCAN_IE_DRXE		(1 << 19)
/** FDCAN1_FDCAN_IE_TOOE Timeout Occurred Enable **/
#define FDCAN1_FDCAN_IE_TOOE		(1 << 18)
/** FDCAN1_FDCAN_IE_MRAFE Message RAM Access Failure Enable **/
#define FDCAN1_FDCAN_IE_MRAFE		(1 << 17)
/** FDCAN1_FDCAN_IE_TSWE Timestamp Wraparound Enable **/
#define FDCAN1_FDCAN_IE_TSWE		(1 << 16)
/** FDCAN1_FDCAN_IE_TEFLE Tx Event FIFO Element Lost Enable **/
#define FDCAN1_FDCAN_IE_TEFLE		(1 << 15)
/** FDCAN1_FDCAN_IE_TEFFE Tx Event FIFO Full Enable **/
#define FDCAN1_FDCAN_IE_TEFFE		(1 << 14)
/** FDCAN1_FDCAN_IE_TEFWE Tx Event FIFO Watermark Reached Enable **/
#define FDCAN1_FDCAN_IE_TEFWE		(1 << 13)
/** FDCAN1_FDCAN_IE_TEFNE Tx Event FIFO New Entry Enable **/
#define FDCAN1_FDCAN_IE_TEFNE		(1 << 12)
/** FDCAN1_FDCAN_IE_TEFE Tx FIFO Empty Enable **/
#define FDCAN1_FDCAN_IE_TEFE		(1 << 11)
/** FDCAN1_FDCAN_IE_TCFE Transmission Cancellation Finished Enable **/
#define FDCAN1_FDCAN_IE_TCFE		(1 << 10)
/** FDCAN1_FDCAN_IE_TCE Transmission Completed Enable **/
#define FDCAN1_FDCAN_IE_TCE		(1 << 9)
/** FDCAN1_FDCAN_IE_HPME High Priority Message Enable **/
#define FDCAN1_FDCAN_IE_HPME		(1 << 8)
/** FDCAN1_FDCAN_IE_RF1LE Rx FIFO 1 Message Lost Enable **/
#define FDCAN1_FDCAN_IE_RF1LE		(1 << 7)
/** FDCAN1_FDCAN_IE_RF1FE Rx FIFO 1 Watermark Reached Enable **/
#define FDCAN1_FDCAN_IE_RF1FE		(1 << 6)
/** FDCAN1_FDCAN_IE_RF1WE Rx FIFO 1 Watermark Reached Enable **/
#define FDCAN1_FDCAN_IE_RF1WE		(1 << 5)
/** FDCAN1_FDCAN_IE_RF1NE Rx FIFO 1 New Message Enable **/
#define FDCAN1_FDCAN_IE_RF1NE		(1 << 4)
/** FDCAN1_FDCAN_IE_RF0LE Rx FIFO 0 Message Lost Enable **/
#define FDCAN1_FDCAN_IE_RF0LE		(1 << 3)
/** FDCAN1_FDCAN_IE_RF0FE Rx FIFO 0 Full Enable **/
#define FDCAN1_FDCAN_IE_RF0FE		(1 << 2)
/** FDCAN1_FDCAN_IE_RF0WE Rx FIFO 0 Full Enable **/
#define FDCAN1_FDCAN_IE_RF0WE		(1 << 1)
/** FDCAN1_FDCAN_IE_RF0NE Rx FIFO 0 New Message Enable **/
#define FDCAN1_FDCAN_IE_RF0NE		(1 << 0)

/**@}*/

/** @defgroup fdcan1_fdcan_ils FDCANILS FDCAN Interrupt Line Select Register
@{*/

/** FDCAN1_FDCAN_ILS_ARAL Access to Reserved Address Line **/
#define FDCAN1_FDCAN_ILS_ARAL		(1 << 29)
/** FDCAN1_FDCAN_ILS_PEDL Protocol Error in Data Phase Line **/
#define FDCAN1_FDCAN_ILS_PEDL		(1 << 28)
/** FDCAN1_FDCAN_ILS_PEAL Protocol Error in Arbitration Phase Line **/
#define FDCAN1_FDCAN_ILS_PEAL		(1 << 27)
/** FDCAN1_FDCAN_ILS_WDIL Watchdog Interrupt Line **/
#define FDCAN1_FDCAN_ILS_WDIL		(1 << 26)
/** FDCAN1_FDCAN_ILS_BOL Bus_Off Status **/
#define FDCAN1_FDCAN_ILS_BOL		(1 << 25)
/** FDCAN1_FDCAN_ILS_EWL Warning Status Interrupt Line **/
#define FDCAN1_FDCAN_ILS_EWL		(1 << 24)
/** FDCAN1_FDCAN_ILS_EPL Error Passive Interrupt Line **/
#define FDCAN1_FDCAN_ILS_EPL		(1 << 23)
/** FDCAN1_FDCAN_ILS_ELOL Error Logging Overflow Interrupt Line **/
#define FDCAN1_FDCAN_ILS_ELOL		(1 << 22)
/** FDCAN1_FDCAN_ILS_BEUL Bit Error Uncorrected Interrupt Line **/
#define FDCAN1_FDCAN_ILS_BEUL		(1 << 21)
/** FDCAN1_FDCAN_ILS_BECL Bit Error Corrected Interrupt Line **/
#define FDCAN1_FDCAN_ILS_BECL		(1 << 20)
/** FDCAN1_FDCAN_ILS_DRXL Message stored to Dedicated Rx Buffer Interrupt Line **/
#define FDCAN1_FDCAN_ILS_DRXL		(1 << 19)
/** FDCAN1_FDCAN_ILS_TOOL Timeout Occurred Interrupt Line **/
#define FDCAN1_FDCAN_ILS_TOOL		(1 << 18)
/** FDCAN1_FDCAN_ILS_MRAFL Message RAM Access Failure Interrupt Line **/
#define FDCAN1_FDCAN_ILS_MRAFL		(1 << 17)
/** FDCAN1_FDCAN_ILS_TSWL Timestamp Wraparound Interrupt Line **/
#define FDCAN1_FDCAN_ILS_TSWL		(1 << 16)
/** FDCAN1_FDCAN_ILS_TEFLL Tx Event FIFO Element Lost Interrupt Line **/
#define FDCAN1_FDCAN_ILS_TEFLL		(1 << 15)
/** FDCAN1_FDCAN_ILS_TEFFL Tx Event FIFO Full Interrupt Line **/
#define FDCAN1_FDCAN_ILS_TEFFL		(1 << 14)
/** FDCAN1_FDCAN_ILS_TEFWL Tx Event FIFO Watermark Reached Interrupt Line **/
#define FDCAN1_FDCAN_ILS_TEFWL		(1 << 13)
/** FDCAN1_FDCAN_ILS_TEFNL Tx Event FIFO New Entry Interrupt Line **/
#define FDCAN1_FDCAN_ILS_TEFNL		(1 << 12)
/** FDCAN1_FDCAN_ILS_TEFL Tx FIFO Empty Interrupt Line **/
#define FDCAN1_FDCAN_ILS_TEFL		(1 << 11)
/** FDCAN1_FDCAN_ILS_TCFL Transmission Cancellation Finished Interrupt Line **/
#define FDCAN1_FDCAN_ILS_TCFL		(1 << 10)
/** FDCAN1_FDCAN_ILS_TCL Transmission Completed Interrupt Line **/
#define FDCAN1_FDCAN_ILS_TCL		(1 << 9)
/** FDCAN1_FDCAN_ILS_HPML High Priority Message Interrupt Line **/
#define FDCAN1_FDCAN_ILS_HPML		(1 << 8)
/** FDCAN1_FDCAN_ILS_RF1LL Rx FIFO 1 Message Lost Interrupt Line **/
#define FDCAN1_FDCAN_ILS_RF1LL		(1 << 7)
/** FDCAN1_FDCAN_ILS_RF1FL Rx FIFO 1 Full Interrupt Line **/
#define FDCAN1_FDCAN_ILS_RF1FL		(1 << 6)
/** FDCAN1_FDCAN_ILS_RF1WL Rx FIFO 1 Watermark Reached Interrupt Line **/
#define FDCAN1_FDCAN_ILS_RF1WL		(1 << 5)
/** FDCAN1_FDCAN_ILS_RF1NL Rx FIFO 1 New Message Interrupt Line **/
#define FDCAN1_FDCAN_ILS_RF1NL		(1 << 4)
/** FDCAN1_FDCAN_ILS_RF0LL Rx FIFO 0 Message Lost Interrupt Line **/
#define FDCAN1_FDCAN_ILS_RF0LL		(1 << 3)
/** FDCAN1_FDCAN_ILS_RF0FL Rx FIFO 0 Full Interrupt Line **/
#define FDCAN1_FDCAN_ILS_RF0FL		(1 << 2)
/** FDCAN1_FDCAN_ILS_RF0WL Rx FIFO 0 Watermark Reached Interrupt Line **/
#define FDCAN1_FDCAN_ILS_RF0WL		(1 << 1)
/** FDCAN1_FDCAN_ILS_RF0NL Rx FIFO 0 New Message Interrupt Line **/
#define FDCAN1_FDCAN_ILS_RF0NL		(1 << 0)

/**@}*/

/** @defgroup fdcan1_fdcan_ile FDCANILE FDCAN Interrupt Line Enable Register
@{*/

/** FDCAN1_FDCAN_ILE_EINT1 Enable Interrupt Line 1 **/
#define FDCAN1_FDCAN_ILE_EINT1		(1 << 1)
/** FDCAN1_FDCAN_ILE_EINT0 Enable Interrupt Line 0 **/
#define FDCAN1_FDCAN_ILE_EINT0		(1 << 0)

/**@}*/

/** @defgroup fdcan1_fdcan_gfc FDCANGFC FDCAN Global Filter Configuration Register
@{*/


