grevaillot/svd_tools/headers/STM32H7x5_CM7/fdcan1.h
/** @defgroup fdcan1_fdcan_tttmc FDCANTTTMC FDCAN TT Trigger Memory Configuration Register
@{*/


#define FDCAN1_FDCAN_TTTMC_TME_SHIFT		16
#define FDCAN1_FDCAN_TTTMC_TME_MASK		0x7f
/** @defgroup fdcan1_fdcan_tttmc_tme TME Trigger Memory Elements
@{*/
/**@}*/


#define FDCAN1_FDCAN_TTTMC_TMSA_SHIFT		2
#define FDCAN1_FDCAN_TTTMC_TMSA_MASK		0x3fff
/** @defgroup fdcan1_fdcan_tttmc_tmsa TMSA Trigger Memory Start Address
@{*/
/**@}*/


/**@}*/

/** @defgroup fdcan1_fdcan_ttrmc FDCANTTRMC FDCAN TT Reference Message Configuration Register
@{*/

/** FDCAN1_FDCAN_TTRMC_RMPS Reference Message Payload Select **/
#define FDCAN1_FDCAN_TTRMC_RMPS		(1 << 31)
/** FDCAN1_FDCAN_TTRMC_XTD Extended Identifier **/
#define FDCAN1_FDCAN_TTRMC_XTD		(1 << 30)

#define FDCAN1_FDCAN_TTRMC_RID_SHIFT		0
#define FDCAN1_FDCAN_TTRMC_RID_MASK		0x1fffffff
/** @defgroup fdcan1_fdcan_ttrmc_rid RID Reference Identifier.
@{*/
/**@}*/


/**@}*/

/** @defgroup fdcan1_fdcan_ttocf FDCANTTOCF FDCAN TT Operation Configuration Register
@{*/

/** FDCAN1_FDCAN_TTOCF_EVTP Event Trigger Polarity **/
#define FDCAN1_FDCAN_TTOCF_EVTP		(1 << 26)
/** FDCAN1_FDCAN_TTOCF_ECC Enable Clock Calibration **/
#define FDCAN1_FDCAN_TTOCF_ECC		(1 << 25)
/** FDCAN1_FDCAN_TTOCF_EGTF Enable Global Time Filtering **/
#define FDCAN1_FDCAN_TTOCF_EGTF		(1 << 24)

#define FDCAN1_FDCAN_TTOCF_AWL_SHIFT		16
#define FDCAN1_FDCAN_TTOCF_AWL_MASK		0xff
/** @defgroup fdcan1_fdcan_ttocf_awl AWL Application Watchdog Limit
@{*/
/**@}*/

/** FDCAN1_FDCAN_TTOCF_EECS Enable External Clock Synchronization **/
#define FDCAN1_FDCAN_TTOCF_EECS		(1 << 15)

#define FDCAN1_FDCAN_TTOCF_IRTO_SHIFT		8
#define FDCAN1_FDCAN_TTOCF_IRTO_MASK		0x7f
/** @defgroup fdcan1_fdcan_ttocf_irto IRTO Initial Reference Trigger Offset
@{*/
/**@}*/


#define FDCAN1_FDCAN_TTOCF_LDSDL_SHIFT		5
#define FDCAN1_FDCAN_TTOCF_LDSDL_MASK		0x07
/** @defgroup fdcan1_fdcan_ttocf_ldsdl LDSDL LD of Synchronization Deviation Limit
@{*/
/**@}*/

/** FDCAN1_FDCAN_TTOCF_TM Time Master **/
#define FDCAN1_FDCAN_TTOCF_TM		(1 << 4)
/** FDCAN1_FDCAN_TTOCF_GEN Gap Enable **/
#define FDCAN1_FDCAN_TTOCF_GEN		(1 << 3)

#define FDCAN1_FDCAN_TTOCF_OM_SHIFT		0
#define FDCAN1_FDCAN_TTOCF_OM_MASK		0x03
/** @defgroup fdcan1_fdcan_ttocf_om OM Operation Mode
@{*/
/**@}*/


/**@}*/

/** @defgroup fdcan1_fdcan_ttmlm FDCANTTMLM FDCAN TT Matrix Limits Register
@{*/


#define FDCAN1_FDCAN_TTMLM_ENTT_SHIFT		16
#define FDCAN1_FDCAN_TTMLM_ENTT_MASK		0xfff
/** @defgroup fdcan1_fdcan_ttmlm_entt ENTT Expected Number of Tx Triggers
@{*/
/**@}*/


#define FDCAN1_FDCAN_TTMLM_TXEW_SHIFT		8
#define FDCAN1_FDCAN_TTMLM_TXEW_MASK		0x0f
/** @defgroup fdcan1_fdcan_ttmlm_txew TXEW Tx Enable Window
@{*/
/**@}*/


#define FDCAN1_FDCAN_TTMLM_CSS_SHIFT		6
#define FDCAN1_FDCAN_TTMLM_CSS_MASK		0x03
/** @defgroup fdcan1_fdcan_ttmlm_css CSS Cycle Start Synchronization
@{*/
/**@}*/


#define FDCAN1_FDCAN_TTMLM_CCM_SHIFT		0
#define FDCAN1_FDCAN_TTMLM_CCM_MASK		0x3f
/** @defgroup fdcan1_fdcan_ttmlm_ccm CCM Cycle Count Max
@{*/
/**@}*/


/**@}*/

/** @defgroup fdcan1_fdcan_turcf FDCANTURCF FDCAN TUR Configuration Register
@{*/

/** FDCAN1_FDCAN_TURCF_ELT Enable Local Time **/
#define FDCAN1_FDCAN_TURCF_ELT		(1 << 31)

#define FDCAN1_FDCAN_TURCF_DC_SHIFT		16
#define FDCAN1_FDCAN_TURCF_DC_MASK		0x3fff
/** @defgroup fdcan1_fdcan_turcf_dc DC Denominator Configuration.
@{*/
/**@}*/


#define FDCAN1_FDCAN_TURCF_NCL_SHIFT		0
#define FDCAN1_FDCAN_TURCF_NCL_MASK		0xffff
/** @defgroup fdcan1_fdcan_turcf_ncl NCL Numerator Configuration Low.
@{*/
/**@}*/


/**@}*/

/** @defgroup fdcan1_fdcan_ttocn FDCANTTOCN FDCAN TT Operation Control Register
@{*/

/** FDCAN1_FDCAN_TTOCN_LCKC TT Operation Control Register Locked **/
#define FDCAN1_FDCAN_TTOCN_LCKC		(1 << 15)
/** FDCAN1_FDCAN_TTOCN_ESCN External Synchronization Control **/
#define FDCAN1_FDCAN_TTOCN_ESCN		(1 << 13)
/** FDCAN1_FDCAN_TTOCN_NIG Next is Gap **/
#define FDCAN1_FDCAN_TTOCN_NIG		(1 << 12)
/** FDCAN1_FDCAN_TTOCN_TMG Time Mark Gap **/
#define FDCAN1_FDCAN_TTOCN_TMG		(1 << 11)
/** FDCAN1_FDCAN_TTOCN_FGP Finish Gap. **/
#define FDCAN1_FDCAN_TTOCN_FGP		(1 << 10)
/** FDCAN1_FDCAN_TTOCN_GCS Gap Control Select **/
#define FDCAN1_FDCAN_TTOCN_GCS		(1 << 9)
/** FDCAN1_FDCAN_TTOCN_TTIE Trigger Time Mark Interrupt Pulse Enable **/
#define FDCAN1_FDCAN_TTOCN_TTIE		(1 << 8)

#define FDCAN1_FDCAN_TTOCN_TMC_SHIFT		6
#define FDCAN1_FDCAN_TTOCN_TMC_MASK		0x03
/** @defgroup fdcan1_fdcan_ttocn_tmc TMC Register Time Mark Compare
@{*/
/**@}*/

/** FDCAN1_FDCAN_TTOCN_RTIE Register Time Mark Interrupt Pulse Enable **/
#define FDCAN1_FDCAN_TTOCN_RTIE		(1 << 5)

#define FDCAN1_FDCAN_TTOCN_SWS_SHIFT		3
#define FDCAN1_FDCAN_TTOCN_SWS_MASK		0x03
/** @defgroup fdcan1_fdcan_ttocn_sws SWS Stop Watch Source.
@{*/
/**@}*/

/** FDCAN1_FDCAN_TTOCN_SWP Stop Watch Polarity **/
#define FDCAN1_FDCAN_TTOCN_SWP		(1 << 2)
/** FDCAN1_FDCAN_TTOCN_ECS External Clock Synchronization **/
#define FDCAN1_FDCAN_TTOCN_ECS		(1 << 1)
/** FDCAN1_FDCAN_TTOCN_SGT Set Global time **/
#define FDCAN1_FDCAN_TTOCN_SGT		(1 << 0)

/**@}*/

/** @defgroup fdcan1_can_ttgtp CANTTGTP FDCAN TT Global Time Preset Register
@{*/


#define FDCAN1_CAN_TTGTP_CTP_SHIFT		16
#define FDCAN1_CAN_TTGTP_CTP_MASK		0xffff
/** @defgroup fdcan1_can_ttgtp_ctp CTP Cycle Time Target Phase
@{*/
/**@}*/


#define FDCAN1_CAN_TTGTP_NCL_SHIFT		0
#define FDCAN1_CAN_TTGTP_NCL_MASK		0xffff
/** @defgroup fdcan1_can_ttgtp_ncl NCL Time Preset
@{*/
/**@}*/


/**@}*/

/** @defgroup fdcan1_fdcan_tttmk FDCANTTTMK FDCAN TT Time Mark Register
@{*/

/** FDCAN1_FDCAN_TTTMK_LCKM TT Time Mark Register Locked **/
#define FDCAN1_FDCAN_TTTMK_LCKM		(1 << 31)

#define FDCAN1_FDCAN_TTTMK_TICC_SHIFT		16
#define FDCAN1_FDCAN_TTTMK_TICC_MASK		0x7f
/** @defgroup fdcan1_fdcan_tttmk_ticc TICC Time Mark Cycle Code
@{*/
/**@}*/


#define FDCAN1_FDCAN_TTTMK_TM_SHIFT		0
#define FDCAN1_FDCAN_TTTMK_TM_MASK		0xffff
/** @defgroup fdcan1_fdcan_tttmk_tm TM Time Mark
@{*/
/**@}*/


/**@}*/

/** @defgroup fdcan1_fdcan_ttir FDCANTTIR FDCAN TT Interrupt Register
@{*/

/** FDCAN1_FDCAN_TTIR_CER Configuration Error **/
#define FDCAN1_FDCAN_TTIR_CER		(1 << 18)
/** FDCAN1_FDCAN_TTIR_AW Application Watchdog **/
#define FDCAN1_FDCAN_TTIR_AW		(1 << 17)
/** FDCAN1_FDCAN_TTIR_WT Watch Trigger **/
#define FDCAN1_FDCAN_TTIR_WT		(1 << 16)
/** FDCAN1_FDCAN_TTIR_IWTG Initialization Watch Trigger **/
#define FDCAN1_FDCAN_TTIR_IWTG		(1 << 15)
/** FDCAN1_FDCAN_TTIR_ELC Error Level Changed. **/
#define FDCAN1_FDCAN_TTIR_ELC		(1 << 14)
/** FDCAN1_FDCAN_TTIR_SE2 Scheduling Error 2 **/
#define FDCAN1_FDCAN_TTIR_SE2		(1 << 13)
/** FDCAN1_FDCAN_TTIR_SE1 Scheduling Error 1 **/
#define FDCAN1_FDCAN_TTIR_SE1		(1 << 12)
/** FDCAN1_FDCAN_TTIR_TXO Tx Count Overflow **/
#define FDCAN1_FDCAN_TTIR_TXO		(1 << 11)
/** FDCAN1_FDCAN_TTIR_TXU Tx Count Underflow **/
#define FDCAN1_FDCAN_TTIR_TXU		(1 << 10)
/** FDCAN1_FDCAN_TTIR_GTE Global Time Error **/
#define FDCAN1_FDCAN_TTIR_GTE		(1 << 9)
/** FDCAN1_FDCAN_TTIR_GTD Global Time Discontinuity **/
#define FDCAN1_FDCAN_TTIR_GTD		(1 << 8)
/** FDCAN1_FDCAN_TTIR_GTW Global Time Wrap **/
#define FDCAN1_FDCAN_TTIR_GTW		(1 << 7)
/** FDCAN1_FDCAN_TTIR_SWE Stop Watch Event **/
#define FDCAN1_FDCAN_TTIR_SWE		(1 << 6)
/** FDCAN1_FDCAN_TTIR_TTMI Trigger Time Mark Event Internal **/
#define FDCAN1_FDCAN_TTIR_TTMI		(1 << 5)
/** FDCAN1_FDCAN_TTIR_RTMI Register Time Mark Interrupt. **/
#define FDCAN1_FDCAN_TTIR_RTMI		(1 << 4)
/** FDCAN1_FDCAN_TTIR_SOG Start of Gap **/
#define FDCAN1_FDCAN_TTIR_SOG		(1 << 3)
/** FDCAN1_FDCAN_TTIR_CSM Change of Synchronization Mode **/
#define FDCAN1_FDCAN_TTIR_CSM		(1 << 2)
/** FDCAN1_FDCAN_TTIR_SMC Start of Matrix Cycle **/
#define FDCAN1_FDCAN_TTIR_SMC		(1 << 1)
/** FDCAN1_FDCAN_TTIR_SBC Start of Basic Cycle **/
#define FDCAN1_FDCAN_TTIR_SBC		(1 << 0)

/**@}*/

/** @defgroup fdcan1_fdcan_ttie FDCANTTIE FDCAN TT Interrupt Enable Register
@{*/

/** FDCAN1_FDCAN_TTIE_CERE Configuration Error Interrupt Enable **/
#define FDCAN1_FDCAN_TTIE_CERE		(1 << 18)
/** FDCAN1_FDCAN_TTIE_AWE Application Watchdog Interrupt Enable **/
#define FDCAN1_FDCAN_TTIE_AWE		(1 << 17)
/** FDCAN1_FDCAN_TTIE_WTE Watch Trigger Interrupt Enable **/
#define FDCAN1_FDCAN_TTIE_WTE		(1 << 16)
/** FDCAN1_FDCAN_TTIE_IWTGE Initialization Watch Trigger Interrupt Enable **/
#define FDCAN1_FDCAN_TTIE_IWTGE		(1 << 15)
/** FDCAN1_FDCAN_TTIE_ELCE Change Error Level Interrupt Enable **/
#define FDCAN1_FDCAN_TTIE_ELCE		(1 << 14)
/** FDCAN1_FDCAN_TTIE_SE2E Scheduling Error 2 Interrupt Enable **/
#define FDCAN1_FDCAN_TTIE_SE2E		(1 << 13)
/** FDCAN1_FDCAN_TTIE_SE1E Scheduling Error 1 Interrupt Enable **/
#define FDCAN1_FDCAN_TTIE_SE1E		(1 << 12)
/** FDCAN1_FDCAN_TTIE_TXOE Tx Count Overflow Interrupt Enable **/
#define FDCAN1_FDCAN_TTIE_TXOE		(1 << 11)
/** FDCAN1_FDCAN_TTIE_TXUE Tx Count Underflow Interrupt Enable **/
#define FDCAN1_FDCAN_TTIE_TXUE		(1 << 10)
/** FDCAN1_FDCAN_TTIE_GTEE Global Time Error Interrupt Enable **/
#define FDCAN1_FDCAN_TTIE_GTEE		(1 << 9)
/** FDCAN1_FDCAN_TTIE_GTDE Global Time Discontinuity Interrupt Enable **/
#define FDCAN1_FDCAN_TTIE_GTDE		(1 << 8)
/** FDCAN1_FDCAN_TTIE_GTWE Global Time Wrap Interrupt Enable **/
#define FDCAN1_FDCAN_TTIE_GTWE		(1 << 7)
/** FDCAN1_FDCAN_TTIE_SWEE Stop Watch Event Interrupt Enable **/
#define FDCAN1_FDCAN_TTIE_SWEE		(1 << 6)
/** FDCAN1_FDCAN_TTIE_TTMIE Trigger Time Mark Event Internal Interrupt Enable **/
#define FDCAN1_FDCAN_TTIE_TTMIE		(1 << 5)
/** FDCAN1_FDCAN_TTIE_RTMIE Register Time Mark Interrupt Enable **/
#define FDCAN1_FDCAN_TTIE_RTMIE		(1 << 4)
/** FDCAN1_FDCAN_TTIE_SOGE Start of Gap Interrupt Enable **/
#define FDCAN1_FDCAN_TTIE_SOGE		(1 << 3)
/** FDCAN1_FDCAN_TTIE_CSME Change of Synchronization Mode Interrupt Enable **/
#define FDCAN1_FDCAN_TTIE_CSME		(1 << 2)
/** FDCAN1_FDCAN_TTIE_SMCE Start of Matrix Cycle Interrupt Enable **/
#define FDCAN1_FDCAN_TTIE_SMCE		(1 << 1)
/** FDCAN1_FDCAN_TTIE_SBCE Start of Basic Cycle Interrupt Enable **/
#define FDCAN1_FDCAN_TTIE_SBCE		(1 << 0)

/**@}*/

/** @defgroup fdcan1_fdcan_ttils FDCANTTILS FDCAN TT Interrupt Line Select Register
@{*/

/** FDCAN1_FDCAN_TTILS_CERL Configuration Error Interrupt Line **/
#define FDCAN1_FDCAN_TTILS_CERL		(1 << 18)
/** FDCAN1_FDCAN_TTILS_AWL Application Watchdog Interrupt Line **/
#define FDCAN1_FDCAN_TTILS_AWL		(1 << 17)
/** FDCAN1_FDCAN_TTILS_WTL Watch Trigger Interrupt Line **/
#define FDCAN1_FDCAN_TTILS_WTL		(1 << 16)
/** FDCAN1_FDCAN_TTILS_IWTGL Initialization Watch Trigger Interrupt Line **/
#define FDCAN1_FDCAN_TTILS_IWTGL		(1 << 15)
/** FDCAN1_FDCAN_TTILS_ELCL Change Error Level Interrupt Line **/
#define FDCAN1_FDCAN_TTILS_ELCL		(1 << 14)
/** FDCAN1_FDCAN_TTILS_SE2L Scheduling Error 2 Interrupt Line **/
#define FDCAN1_FDCAN_TTILS_SE2L		(1 << 13)
/** FDCAN1_FDCAN_TTILS_SE1L Scheduling Error 1 Interrupt Line **/
#define FDCAN1_FDCAN_TTILS_SE1L		(1 << 12)
/** FDCAN1_FDCAN_TTILS_TXOL Tx Count Overflow Interrupt Line **/
#define FDCAN1_FDCAN_TTILS_TXOL		(1 << 11)
/** FDCAN1_FDCAN_TTILS_TXUL Tx Count Underflow Interrupt Line **/
#define FDCAN1_FDCAN_TTILS_TXUL		(1 << 10)
/** FDCAN1_FDCAN_TTILS_GTEL Global Time Error Interrupt Line **/
#define FDCAN1_FDCAN_TTILS_GTEL		(1 << 9)
/** FDCAN1_FDCAN_TTILS_GTDL Global Time Discontinuity Interrupt Line **/
#define FDCAN1_FDCAN_TTILS_GTDL		(1 << 8)
/** FDCAN1_FDCAN_TTILS_GTWL Global Time Wrap Interrupt Line **/
#define FDCAN1_FDCAN_TTILS_GTWL		(1 << 7)
/** FDCAN1_FDCAN_TTILS_SWEL Stop Watch Event Interrupt Line **/
#define FDCAN1_FDCAN_TTILS_SWEL		(1 << 6)
/** FDCAN1_FDCAN_TTILS_TTMIL Trigger Time Mark Event Internal Interrupt Line **/
#define FDCAN1_FDCAN_TTILS_TTMIL		(1 << 5)
/** FDCAN1_FDCAN_TTILS_RTMIL Register Time Mark Interrupt Line **/
#define FDCAN1_FDCAN_TTILS_RTMIL		(1 << 4)
/** FDCAN1_FDCAN_TTILS_SOGL Start of Gap Interrupt Line **/
#define FDCAN1_FDCAN_TTILS_SOGL		(1 << 3)
/** FDCAN1_FDCAN_TTILS_CSML Change of Synchronization Mode Interrupt Line **/
#define FDCAN1_FDCAN_TTILS_CSML		(1 << 2)
/** FDCAN1_FDCAN_TTILS_SMCL Start of Matrix Cycle Interrupt Line **/
#define FDCAN1_FDCAN_TTILS_SMCL		(1 << 1)
/** FDCAN1_FDCAN_TTILS_SBCL Start of Basic Cycle Interrupt Line **/
#define FDCAN1_FDCAN_TTILS_SBCL		(1 << 0)

/**@}*/

